---
type: CommandEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# CommandEventArgs

`Autodesk.Revit.UI.Events.CommandEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ActiveDocument | 2013 | `public Document ActiveDocument { get ; }` |
| Property | CommandId | 2013 | `public RevitCommandId CommandId { get ; }` |